Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	// TODO: Вставить содержимое обработчика
	
	Если ТребуемыеПараметры <> Неопределено Тогда
		
		Для Каждого ИмяПараметра Из ТребуемыеПараметры Цикл
			
			Если ИмяПараметра = "ТекущийПользователь" Тогда
				
				ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
				
				Если ТекущийПользовательИБ <> Неопределено Тогда
					
					ПараметрыСеанса.ТекущийПользователь = ТекущийПользовательИБ;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПолучитьПользователя(Пользователь);
		
	КонецЕсли;
	
	// FIXME: Необходимо исправить ошибку
	// XXX: Нужно переписать код
	
КонецПроцедуры
